### Select/count/distinct

The LIMIT will reduce the number of rows to return

OFFSET will specify where to begin counting the number rows from.

In [ ]:
-- counting number of rows
SELECT COUNT(*) FROM FilmLocations;
-- We want to count the number of locations of the films. But we also want to restrict the output result set so that we only retrieve the number of locations of the films written by a certain writer.
SELECT COUNT(Locations) FROM FilmLocations WHERE Writer="James Cameron";
-- Finding titles of all distinct films
SELECT DISTINCT Title FROM FilmLocations;
--We want to retrieve the count of release years of the films produced by a specific company so that duplicate release years of those films will be discarded in the count.
SELECT COUNT(DISTINCT ReleaseYear) FROM FilmLocations WHERE ProductionCompany="Warner Bros. Pictures";
--Retrieve only the first 25 rows from the table so that rows other than those are not in the output result set.
SELECT * FROM FilmLocations LIMIT 25;
--Now, we want to retrieve 15 rows from the table starting from row 11.
SELECT * FROM FilmLocations LIMIT 15 OFFSET 10

### Queries with constraints

##### Numbers

In [ ]:
-- standard numerical operators

col_name = 4
col_name != 4
col_name > 4
col_name <= 4

-- number between a range of two values (inclusive)

col_name BETWEEN 1.5 AND 10.5

-- number NOT between a range of two values (inclusive)

col_name NOT BETWEEN 1.5 AND 10.5

-- number exists in a list

col_name IN (2,4,6)

-- number DOESN'T exist in a list

col_name NOT IN (2,4,6)

##### Strings

In [ ]:
-- case sensitive exact string comparison (single equals)

col_name = "abc"

-- case sensitive exact string inequality comparison

col_name != "abc"
col_name <> "abc"

-- case insensitive exact string comparison

col_name LIKE "abc"

-- case insensitive exact string inequality comparison

col_name NOT LIKE "abcd"

-- used anywhere in a string to match a sequence of zero or more characters (only with LIKE or NOT LIKE)

col_name LIKE "%AT%" -- matches "AT", "ATTIC", "CAT", or even "BATS". Any word with "AT" somewhere inside it

-- used anywhere in a string to match a single character (only with LIKE or NOT LIKE) 

col_name LIKE "AN_" -- matches "AND", but not "AN"

-- string exists in a list

col_name IN ("A", "B", "C")

-- string does not exist in a list

col_name NOT IN ("A", "B", "C")

##### INSERT / UPDATE / DELETE

In [ ]:
-- Insert
INSERT INTO table_name (column1, column2, ... )
VALUES (value1, value2, ... )
;
-- Example. Insert two new instructor records into the “Instructor” table. First record with id 5 for John Doe who lives in Sydney, AU. Second record with id 6 for Jane Doe who lives in Dhaka, BD.
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(5, 'Doe', 'John', 'Sydney', 'AU'), (6, 'Doe', 'Jane', 'Dhaka', 'BD');

-- Update
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition
;
-- Example
UPDATE Instructor 
SET city='Dubai', country='AE' 
WHERE ins_id=5;

-- Delete
DELETE FROM table_name
WHERE condition
;
-- Example
DELETE FROM instructor
WHERE ins_id = 6;

#### DDL Statements

##### Create

In [ ]:
-- create a table for canadian provinces. Below, id must have two characters and can't be null,
-- name can have max number of 24 characters

CREATE TABLE provinces(
    id char(2) PRIMARY KEY NOT NULL,
    name varchar(24)
)

-- create a table for authors

CREATE TABLE author (
    author_id CHAR(2) PRIMARY KEY NOT NULL,
    lastname VARCHAR(15) NOT NULL,
    firstname VARCHAR(15) NOT NULL,
    email VARCHAR(40),
    city VARCHAR(15),
    country CHAR(2)
)

-- create table if doesn't already exist

CREATE TABLE IF NOT EXISTS mytable (
    ... 
)

##### Data types

- INTEGER/BOOLEAN --> in some implementation, the boolean values is just represented as an integer  value of just 0 or 1.

- FLOAT / DOUBLE / REAL --> for storing floating point numbers

- CHARACTER(max_num_chars) / VARCHAR(max_num_chars) / TEXT --> for storing text

- DATE / DATETIME --> for time 

- BLOB --> can store binary data in blobs right in the database. 

##### Constraints

- PRIMARY KEY --> means that values in this column are unique, and each value can be used to identify a single row in this table

- AUTOINCREMENT --> for integer values, this means that the value is automatically filled in and incremented with each row insertion. Not supported in all databases.

- UNIQUE --> this means that the values in this column have to be unique, so you can't insert another row with the same value in this column as another row in the table. Differs from the 'PRIMARY KEY' in that it doesn't have to be a key for a row in the table.

- NOT NULL --> this means that the inserted value can not be 'NULL'

- CHECK (expression) --> this allows you to turn a more complex expression to test whether the values inserted are valid. for example, you can check that values are positive, or greater than a specific size, or start with a certain prefix, etc.

- FOREIGN KEY --> this is a consistency check which ensures that each values in this column corresponds to another value in a column in another table.

##### Alter --> no parantheses

In [ ]:
-- adding a column with alter

ALTER TABLE table_name
ADD COLUMN column_name data_type;

-- modifying column data type

ALTER TABLE table_name
MODIFY column_name data_type

-- removing columns

ALTER TABLE mytable
DROP column_to_be_deleted;

-- renaming table
ALTER TABLE mytable
RENAME TO new_table_name;

Truncate --> used to delete all rows of a table

In [ ]:
TRUNCATE TABLE table_name;

CREATE TABLE -> to create a table

In [ ]:
CREATE TABLE TableName (
    COLUMN1 datatype,
    COLUMN2 dataype,
    ...
);

-- example

CREATE TABLE COUNTRY (
    ID int,
    CCDOE char(2),
    Name varchar(60)
);

Creating a table using data from another table, in the same schema (data_mart)

In [ ]:
CREATE TABLE data_mart.clean_weekly_sales AS
SELECT
    TO_DATE(raw_date, 'FMDD/FMMM/YY') AS sale_date,
    product_id,
    weekly_sales
FROM
    data_mart.raw_sales_data;

DROP --> to delete a table

In [ ]:
-- example of dropping a table before creating a new table with the same name

DROP TABLE COUNTRY;
CREATE TABLE COUNTRY (
    ID int,
    CCDOE char(2),
    Name varchar(60)
);

#### String Patterns

Using ‘like’ predicate

In [ ]:
-- Selecting all surnames/names of employees living in ‘Elgin, IL’

SELECT F_NAME, L_NAME
FROM EMPLOYEES
WHERE ADDRESS LIKE '%Elgin,IL%';

-- identify the employees who were born during the 70s
SELECT F_NAME, L_NAME
FROM EMPLOYEES
WHERE B_DATE LIKE '197%';

-- Let us retrieve all employee records in department 5 where salary is between 60000 and 70000
SELECT *
FROM EMPLOYEES
WHERE (SALARY BETWEEN 60000 AND 70000) AND DEP_ID = 5;

##### Sorting

In [ ]:
-- Using order by clause

SELECT F_NAME, L_NAME, DEP_ID 
FROM EMPLOYEES
ORDER BY DEP_ID;

-- Adding ‘DESC’ after feature → descending order

SELECT F_NAME, L_NAME, DEP_ID 
FROM EMPLOYEES
ORDER BY DESC DEP_ID;

##### Grouping

In [ ]:
-- For each department ID, we wish to retrieve the number of employees in the department.
SELECT DEP_ID, COUNT(*)
FROM EMPLOYEES
GROUP BY DEP_ID;

--for each department, retrieve the number of employees in the department and the average 
-- employee salary in the department

SELECT DEP_ID, COUNT(*), AVG(SALARY)
FROM EMPLOYEES
GROUP BY DEP_ID;

-- Label the computed columns in the result set of the last problem as NUM_EMPLOYEES and AVG_SALARY.

SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID;

--In the previous example, if we wish to limit the result to departments with fewer than 4 employees,
-- We will have to use HAVING after the GROUP BY, and use the count() function in the HAVING clause instead
-- of the column label.
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING count(*) < 4
ORDER BY AVG_SALARY;

##### PARTITION BY

- it divides result set rows into partitions for independent window function application, unlike grouping as it doesn't collapse rows.

In [ ]:
ROW_NUMBER() OVER (PARTITION BY customer_id ORDER BY order_date) AS rn

This does the following:

- Partition: It divides the data into groups based on each customer_id.

- Order: Within each customer_id group, it orders the rows by order_date.

- Calculation: It then assigns a row number (rn) to each row within its respective partition, starting at 1 for the earliest order_date in each customer group.

- ROW_NUMBER() : gives a window function that assigns a unique sequential integer to each row within a result set or within a defined partition of the result set.

##### Aggregation Functions

- SUM

- MAX

- MIN

- AVG

- ROUND(COLUMN_NAME, NUMBER_OF_DECIMALS)

- LENGTH(COLUMN_NAME) (gives length of element in column)

- Upper case /lower case : UCASE/LCASE

In [ ]:
-- example: Calculate the total cost of all animal rescues in the PETRESCUE table, then display it as ‘SUM_OF_COST’
SELECT SUM(COST) AS SUM_OF_COST FROM PETRESCUE;

##### Date functions

- DAY()

- MONTH()

- YEAR()

- DATE_ADD(DATE, INTERVAL number TIMEFRAME).

- DATE_SUB(DATE, INTERVAL number TIMEFRAME)

- DATEDIFF(Date 1, Date 2)

In [ ]:
-- Animals rescued should see the vet within three days of arrival. Write a query that displays the third day of each rescue.
SELECT DATE_ADD(RESCUEDATE, INTERVAL 3 DAY) FROM PETRESCUE

-- Similarly, we can retrieve a date before the one given in the column by a given number using the function DATE_SUB
SELECT DATE_SUB(RESCUEDATE, INTERVAL 3 DAY) FROM PETRESCUE

-- using DATEDIFF 
SELECT DATEDIFF(CURRENT_DATE, RESCUEDATE) FROM PETRESCUE

-- To present the output in a YYYY-MM-DD format, another function FROM_DAYS(number_of_days) can be used. 
-- This function takes a number of days and returns the required formatted output. The query above would thus be modified to
SELECT FROM_DAYS(DATEDIFF(CURRENT_DATE, RESCUEDATE)) FROM PETRESCUE

#### Sub-queries: a query inside another query

Useful as often can’t call functions directly outside of sub-queries.

In [ ]:
-- This command will generate an error:
SELECT * 
FROM EMPLOYEES 
WHERE salary < AVG(salary);

--Instead do
SELECT *
FROM EMPLOYEES
WHERE SALARY < (SELECT AVG(SALARY) FROM EMPLOYEES);


-- Now, consider executing a query that retrieves all employee records with EMP_ID, SALARY, and maximum salary as MAX_SALARY in every row.
SELECT EMP_ID, SALARY, (SELECT MAX(SALARY) FROM EMPLOYEES) AS MAX_SALARY 
FROM EMPLOYEES;


-- Now, consider that you wish to extract the first and last names of the oldest employee
SELECT F_NAME, L_NAME
FROM EMPLOYEES
WHERE B_DATE = (SELECT MIN(B_DATE) FROM EMPLOYEES);


-- Using sub-queries to create derived table. E.g. you want to know the average salary of the top 5 earners in the company. 
SELECT AVG(SALARY) 
FROM (SELECT SALARY 
      FROM EMPLOYEES 
      ORDER BY SALARY DESC 
      LIMIT 5) AS SALARY_TABLE;

##### Accessing multiple tables with same query

- Inner join: a process that matches rows from the first table and the second table which have the same key (as defined by the ON constraint) to create a result row with the combined columns from both tables.

In [ ]:
-- syntax
SELECT column, another_table_column, …
FROM mytable
INNER JOIN another_table 
    ON mytable.id = another_table.id
WHERE condition(s)
ORDER BY column, … ASC/DESC
LIMIT num_limit OFFSET num_offset;


-- example
SELECT * FROM Movies INNER JOIN Boxoffice ON Movies.Id = Boxoffice.Movie_id ORDER BY Rating DESC;

If two tables have asymmetric data, can’t just use INNER JOIN. HAVE TO USE LEFT/RIGHT/FULL JOIN

When joining table A to table B, a LEFT JOIN simply includes rows from A regardless of whether a matching row is found in B. The RIGHT JOIN is the same, but reversed, keeping rows in B regardless of whether a match is found in A. Finally, a FULL JOIN simply means that rows from both tables are kept, regardless of whether a matching row exists in the other table.

##### Note on NULLs

Often useful to use NULLs with such Expressions
Nulls: empty space

In [ ]:
SELECT * FROM employees WHERE Building IS NULL;

Note on aliases (in PostgreSQL) → if you are working with a subquery, must always use alias. See below:

In [ ]:
SELECT joined_data.region_name, COUNT(DISTINCT joined_data.customer_id) FROM 
(SELECT 
  r.region_id, r.region_name, 
  c.customer_id, c.node_id, c.start_date, c.end_date
FROM 
  data_bank.regions r
INNER JOIN 
  data_bank.customer_nodes c 
  ON r.region_id = c.region_id) AS joined_data GROUP BY joined_data.region_name;

Retrieve only the EMPLOYEES records corresponding to jobs in the JOBS table.

In [ ]:
SELECT * FROM EMPLOYEES WHERE JOB_ID IN (SELECT JOB_IDENT FROM JOBS);

In [ ]:
-- Retrieve JOB information for employees earning over $70,000. For this example, retrieve the details from the 
-- JOBS table, which has common IDs with those available in the EMPLOYEES table, provided the salary in the EMPLOYEES 
-- table is greater than $70,000.

SELECT JOB_TITLE, MIN_SALARY, MAX_SALARY, JOB_IDENT
FROM JOBS
WHERE JOB_IDENT IN (select JOB_ID from EMPLOYEES where SALARY > 70000 );

Implicit Joins

In [ ]:
-- Retrieve only the EMPLOYEES records corresponding to jobs in the JOBS table.
SELECT *
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;


-- Query above, but using shorter aliases (E and J)
SELECT *
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;


-- In the previous query, retrieve only the Employee ID, Name, and Job Title
SELECT E.EMP_ID, E.F_NAME, E.L_NAME, J.JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;

##### Order of queries

In [ ]:
SELECT DISTINCT column, AGG_FUNC(column_or_expression), …
FROM mytable
    JOIN another_table
      ON mytable.column = another_table.column
    WHERE constraint_expression
    GROUP BY column
    HAVING constraint_expression
    ORDER BY column ASC/DESC
    LIMIT count OFFSET COUNT;

### Unions, Intersections and Exceptions


the UNION and UNION ALL operator allows you to append the results of one query to another assuming that they have the same column count, order and data type. If you use the UNION without the ALL, duplicate rows between the tables will be removed from the result.

In [ ]:
SELECT column, another_column
   FROM mytable
UNION / UNION ALL / INTERSECT / EXCEPT
SELECT other_column, yet_another_column
   FROM another_table
ORDER BY column DESC
LIMIT n;

#### Accessing databases using python

In [ ]:
## Code for creating database using SQLite
!pip install sqlite3  ##Uncomment this code only if you are working in a local environment to install sqlite3
import sqlite3
# Connecting to sqlite
# connection object
conn = sqlite3.connect('INSTRUCTOR.db')
# cursor object: Cursor class is an instance using which you can invoke methods that execute SQLite statements, fetch data from the result sets of the queries. You can create Cursor object using the cursor() method of the Connection object/class.
cursor_obj = conn.cursor()
# Creating table
table = """ create table IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""
cursor_obj.execute(table)
# inserting first row
cursor_obj.execute('''insert into INSTRUCTOR values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')
# fetching all data
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
# If you want to fetch few rows from the table we use fetchmany(numberofrows) and mention the number how many rows you want to fetch
output_many = cursor_obj.fetchmany(2) 
for row_many in output_many:
  print(row_many)
print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
  print(row_all)
Retrieving data using pandas
import pandas as pd
#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("select * from instructor;", conn)
# Close the connection
conn.close()

Reading .csv files --> To query columns in a table: use backticks ``

In [ ]:
# Using pandas to convert csv file to a table in SQLite
import pandas
df = pandas.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv")
df.to_sql("CHICAGO_PUBLIC_SCHOOLS_DATA", con, if_exists='replace', index=False, method="multi")

# Getting list of all tables in database
%sql SELECT name FROM sqlite_master WHERE type='table'

# Finding number of columns in SCHOOLS table
%sql SELECT count(name) FROM PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS_DATA');

# Getting list of columns and column type in SCHOOLS table
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS_DATA');

# Saving a pseudo-table you've configured from other tables
 WITH FULL_TABLE AS (SELECT query)

#### PARTITION BY : We can use the SQL PARTITION BY clause with ROW_NUMBER() function to have a row number of each row

In [ ]:
-- Example
SELECT customer_id, product_id, ROW_NUMBER() OVER (PARTITION BY customer_id ORDER BY product_id) AS rn FROM FULL_TABLE;

Output:

| customer_id    | product_id | rn | 
| -------- | ------- | ------- |
| A  | 1    | 1    |
| A  | 2    | 2    |
| A  | 2    | 3    |
| A  | 3    | 4    |
| A  | 3    | 5    |
| A  | 3    | 6    |
| B  | 1    | 1    |
| B  | 1    | 2    |
| B  | 2    | 3    |
| B  | 2    | 4    |
| B  | 3    | 5    |
| B  | 3    | 6    |
| C  | 3    | 1    |
| C  | 3    | 2    |
| C  | 3    | 3    |

#### RANK()
functions assign a unique rank to each distinct row in the result set, with tied rows receiving the same rank and leaving gaps in subsequent ranks. For example, if two rows tie for first place, the next row will receive a rank of 3.

In [ ]:
RANK() OVER (PARTITION BY column1, column2, ... ORDER BY sort_column1, sort_column2, ...)

DENSE_RANK() also assigns ranks based on criteria, but it does not leave gaps between ranks in case of tied rows.

Another use for partition by


I have three columns in my dataset. One is called platform, and takes binary values "retail" or "shopify". The other column is called sales. the last column gives the month. I want to find the percentage of sales for Retail vs Shopify for each month.

In [ ]:
SELECT
    month,
    platform,
    SUM(sales) AS platform_sales,
    ROUND(100.0 * SUM(sales) / SUM(SUM(sales)) OVER (PARTITION BY month), 2) AS percentage_of_month_sales
FROM
    your_table_name
GROUP BY
    month,
    platform
ORDER BY
    month,
    platform;

-- explanation 
-- SUM(sales): sums sales per platform and month.
-- SUM(SUM(sales)) OVER (PARTITION BY month): computes total sales for each month across both platforms.
-- The percentage is computed by dividing platform sales by total monthly sales.
-- ROUND(..., 2) limits it to two decimal places.

Using GROUP BY and ORDER BY on multiple features at the same time

In [ ]:
ORDER BY column1 DESC, column2

-- This sorts everything by column1 (descending) first, and then by column2 (ascending, which is the default) 
-- whenever the column1 fields for two or more rows are equal.

Group BY X, Y 

-- means put all those with the same values for both X and Y in the one group.

-- So for example below, partition set into unique (customer_id, product_name) combinations, 
-- counting frequency of each, and then order firstly by customer_id, and then then internally by count
SELECT customer_id,product_name,count(*) FROM FULL_TABLE
GROUP BY 1,2
ORDER BY 1,3 DESC;

Output:

| customer_id    | product_id | rn | 
| -------- | ------- | ------- |
| A  | ramen    | 3    |
| A  | curry   | 2    |
| A  | sushi    | 1    |
| B  | sushi    | 2    |
| B  | curry    | 2    |
| B  | ramen    | 2    |
| C  | ramen    | 3    |

## ‘temp’

have to add it after a temporary table you’ve created, like below

In [ ]:
SELECT customer_id,
       product_name
FROM (
    SELECT customer_id,
           product_name as most_popular_item,
           DENSE_RANK() OVER (
               PARTITION BY customer_id
               ORDER BY COUNT(*) DESC
           ) AS dn
    FROM CTE
    GROUP BY 1, 2
) temp
WHERE dn = 1
ORDER BY 1;


##### CASE
The CASE expression goes through conditions and returns a value when the first condition is met (like an if-then-else statement). So, once a condition is true, it will stop reading and return the result. If no conditions are true, it returns the value in the ELSE clause.

If there is no ELSE part and no conditions are true, it returns NULL.

Below, in example, we can see how this function is useful for creating mappings between one column and a new column.

In [ ]:
-- Syntax
CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    WHEN conditionN THEN resultN
    ELSE result
END;


-- Example
SELECT 
  txn_amount,
  CASE 
    WHEN txn_amount > 1000 THEN 'High'
    WHEN txn_amount > 500 THEN 'Medium'
    ELSE 'Low'
  END AS txn_category
FROM customer_transactions;

-- Above, name of feature/column (‘txn_category’) is assigned after all cases (after ‘END AS’)

#### Working with times and dates

When working with dd-mm-yyyy hh:mm:ss format, can use Extract function

In [ ]:
SELECT Name, Extract(YEAR FROM BirthTime)
AS BirthYear FROM Test;
SELECT Name, Extract(DAY FROM
BirthTime) AS BirthDay FROM Test;
SELECT Name, Extract(SECOND FROM
BirthTime) AS BirthSecond FROM Test;

The DATE_ADD() function allows you to add a specified time interval to a date.

In [ ]:
DATE_ADD(date, INTERVAL expr type);

Converting string 'dd/mm/yyyy' to proper DATE format:

In [ ]:
--syntax
SELECT TO_DATE('9/9/20', 'FMDD/FMMM/YY')::DATE;

--example
SELECT week_date, TO_DATE(week_date, 'FMDD/FMMM/YY') AS converted_date
FROM data_mart.weekly_sales
LIMIT 10;

--above, w/out raw date
SELECT TO_DATE(week_date, 'FMDD/FMMM/YY') AS converted_date
FROM data_mart.weekly_sales
LIMIT 10;

Finding day of year (out of 365) given a date

In [ ]:
EXTRACT(DOY FROM TO_DATE(week_date, 'FMDD/FMMM/YY'))::INT AS day_of_year,

Finding week_number: for example any value from the 1st of January to 7th of January will be 1, 8th to 14th will be 2 etc

In [ ]:
CEIL(EXTRACT(DOY FROM week_date)::NUMERIC / 7) AS custom_week
--Breakdown:
-- EXTRACT(DOY FROM week_date) gives the day of year (1–365/366).

-- Dividing by 7 and using CEIL(...) groups days into 7-day blocks starting from Jan 1.

-- he result: Jan 1–7 → Week 1, Jan 8–14 → Week 2, etc.

Extracting day of the week (monday, tuesday,..) given a date in DATE format (dd-mm-yyyy)

In [ ]:
--if date_column contains dates in DATE format
SELECT TO_CHAR(date_column, 'Day') AS day_name
FROM your_table;

Division with floats

In [ ]:
SELECT CAST(1 AS float) / CAST(3 AS float)

#### LAG

The LAG() function belongs to a category of functions known as window functions. This means it is possible to retrieve the value of the previous row from the current row of the result set. While aggregate functions are used to return a single value for a certain group of rows, for example, the LAG() function does not collapse and returns values for each row over a fixed set of rows.

In [ ]:
-- Syntax
LAG (scalar_expression [, offset [, default ]]) OVER ( [ partition_by_clause ] order_by_clause )

-- Example
SELECT Organisation, [Year], Revenue,
LAG (Revenue, 1, 0) 
OVER (PARTITION BY Organisation ORDER BY [Year]) AS PrevYearRevenue  
FROM Org 
ORDER BY Organisation, [Year];

Output


| Organisation    | Year | Revenue | PrevYearRevenue | 
| -------- | ------- | ------- | ------- |
| ABCD News  | 2013    | 440000    | 0    |  
| ABCD News  | 2014    | 480000    | 440000    |  
| ABCD News  | 2015    | 490000    | 480000    |  
| ABCD News  | 2016    | 500000    | 490000    |  
| ABCD News  | 2017    | 520000    | 500000    |  
| ABCD News  | 2018    | 525000    | 5200000    |  
| ABCD News  | 2019    | 540000    | 525000    |  
| ABCD News  | 2020    | 550000    | 540000    |  
| Z News  | 2016    | 720000    | 0    |  
| Z News  | 2017    | 750000    | 720000    |  
| Z News  | 2018    | 780000    | 750000    |  
| Z News  | 2019    | 880000    | 780000    |  
| Z News  | 2020    | 910000    | 880000    |

##### LEAD()

The LEAD() window function takes a column and an integer offset as arguments and returns the value of the cell in that column that is the specified number of rows after the current row. A third argument can be added to fill cells that do not have a corresponding row.

In [ ]:
LEAD(column1_name, offset) OVER(
  ORDER BY column2_name
)

Example. For this data table

| Month    | Sales | 
| -------- | ------- | 
| 1  | 1000    |
| 2  | 500    |
| 3  | 750    |
| 4  | 800    |

In [ ]:
SELECT month,
 sales,
 LEAD(sales, 1, "NA") OVER(
   ORDER BY month
 ) AS next_month_sales
FROM yearly_sales;

output

| Month    | Sales | next_month_sales | 
| -------- | ------- | ------- | 
| 1  | 1000    | 500    |
| 2  | 500    | 750    |
| 3  | 750    | 800    |

#### Median, 80th, 95th percentiles

In [ ]:
WITH days_table as (select (end_date-start_date) as days from customer_nodes where end_date != '9999-12-31')
SELECT 
  percentile_cont(0.5) WITHIN GROUP (ORDER BY days) AS median,
  percentile_cont(0.8) WITHIN GROUP (ORDER BY days) AS percentile80,
  percentile_cont(0.95) WITHIN GROUP (ORDER BY days) AS percentile95
FROM days_table

##### FILTER

In [ ]:
COUNT(*) FILTER (WHERE condition)

-- This means: "Count the rows that match this condition."

##### Common Table Expression (CTE)

Consider the following query. Note, how call the function TO_DATE(week_date, 'FMDD/FMMM/YY') three times on three separate occasions. How can we fix this?

In [ ]:
CREATE TABLE data_mart.clean_weekly_sales AS
SELECT
    TO_DATE(week_date, 'FMDD/FMMM/YY') AS week_date_converted,
    EXTRACT(DOY FROM TO_DATE(week_date, 'FMDD/FMMM/YY'))::INT AS day_of_year,
    CEIL(EXTRACT(DOY FROM TO_DATE(week_date, 'FMDD/FMMM/YY'))::NUMERIC / 7) AS custom_week
FROM
    data_mart.weekly_sales;

SELECT * FROM data_mart.clean_weekly_sales;

We CANNOT simply use week_date_converted as an alias for TO_DATE(week_date, 'FMDD/FMMM/YY') after we declare it in seelct clause, as this would result in error

In [ ]:
CREATE TABLE data_mart.clean_weekly_sales AS
SELECT
    TO_DATE(week_date, 'FMDD/FMMM/YY') AS week_date_converted,
    -- below would result in ERROR
    EXTRACT(DOY FROM week_date_converted)::INT AS day_of_year,
    CEIL(EXTRACT(DOY FROM week_date_converted)::NUMERIC / 7) AS custom_week
FROM
    data_mart.weekly_sales;

SELECT * FROM data_mart.clean_weekly_sales;

Instead use Commont Table Expression (CTE).  CTE is a way to define a temporary result set (a kind of named subquery) that exists only within the scope of a single query. 

It's useful when:

- You want to avoid repeating complex expressions (e.g., TO_DATE(...)) multiple times.

- You want to break your query into logical, readable steps.

- You need to reference a calculated value multiple times in the same query.

❓ So why can’t you reuse an alias like week_date_converted directly in the same SELECT?

Because in standard SQL (including PostgreSQL), column aliases are only visible in the ORDER BY clause, not in other expressions within the same SELECT clause.

The CTE evaluates TO_DATE(...) once, assigns it the name week_date_converted, and makes it reusable like a temporary table:

In [ ]:
CREATE TABLE data_mart.clean_weekly_sales AS
WITH converted AS (
    SELECT
        TO_DATE(week_date, 'FMDD/FMMM/YY') AS week_date_converted
    FROM
        data_mart.weekly_sales
)
SELECT
    week_date_converted,
    EXTRACT(DOY FROM week_date_converted)::INT AS day_of_year,
    CEIL(EXTRACT(DOY FROM week_date_converted)::NUMERIC / 7) AS custom_week
FROM
    converted;

##### Generating Series

If we want to create a series of all numbers within a certain range, use generate_series()

In [ ]:
SELECT * FROM generate_series(2,4);
 generate_series
-----------------
               2
               3
               4
(3 rows)

SELECT * FROM generate_series(5,1,-2);
 generate_series
-----------------
               5
               3
               1
(3 rows)

SELECT * FROM generate_series(4,3);
 generate_series
-----------------
(0 rows)

SELECT generate_series(1.1, 4, 1.3);
 generate_series
-----------------
             1.1
             2.4
             3.7
(3 rows)

-- this example relies on the date-plus-integer operator:
SELECT current_date + s.a AS dates FROM generate_series(0,14,7) AS s(a);
   dates
------------
 2004-02-05
 2004-02-12
 2004-02-19
(3 rows)

SELECT * FROM generate_series('2008-03-01 00:00'::timestamp,
                              '2008-03-04 12:00', '10 hours');
   generate_series
---------------------
 2008-03-01 00:00:00
 2008-03-01 10:00:00
 2008-03-01 20:00:00
 2008-03-02 06:00:00
 2008-03-02 16:00:00
 2008-03-03 02:00:00
 2008-03-03 12:00:00
 2008-03-03 22:00:00
 2008-03-04 08:00:00
(9 rows)

-- this example assumes that TimeZone is set to UTC; note the DST transition:
SELECT * FROM generate_series('2001-10-22 00:00 -04:00'::timestamptz,
                              '2001-11-01 00:00 -05:00'::timestamptz,
                              '1 day'::interval, 'America/New_York');
    generate_series
------------------------
 2001-10-22 04:00:00+00
 2001-10-23 04:00:00+00
 2001-10-24 04:00:00+00
 2001-10-25 04:00:00+00
 2001-10-26 04:00:00+00
 2001-10-27 04:00:00+00
 2001-10-28 04:00:00+00
 2001-10-29 05:00:00+00
 2001-10-30 05:00:00+00
 2001-10-31 05:00:00+00
 2001-11-01 05:00:00+00
(11 rows)

In [ ]:
CREATE TABLE data_mart.clean_weekly_sales AS
SELECT
    TO_DATE(week_date, 'FMDD/FMMM/YY') AS week_date_converted,
    CEIL(EXTRACT(DOY FROM TO_DATE(week_date, 'FMDD/FMMM/YY'))::NUMERIC / 7) AS week_number,
    Extract(MONTH FROM TO_DATE(week_date, 'FMDD/FMMM/YY')) AS month_number,
    Extract(YEAR FROM TO_DATE(week_date, 'FMDD/FMMM/YY')) AS calender_year,
    segment,
    CASE
    	WHEN segment LIKE '%1' THEN 'Young Adults'
        WHEN segment LIKE '%2' THEN 'Middle Aged'
        WHEN segment LIKE '%3' THEN 'Retirees'
        WHEN segment LIKE '%4' THEN 'Retirees'
        ELSE null
    END AS age_band,
    CASE
    	WHEN segment LIKE 'C%' THEN 'Couples'
        WHEN segment LIKE 'F%' THEN 'Families'
        ELSE null
    END AS demographic, 
    ROUND(sales::NUMERIC/transactions, 2) AS avg_transaction
FROM
    data_mart.weekly_sales;
    
WITH all_weeks AS (
    SELECT generate_series(1, 52) AS week_number
)


SELECT
    all_weeks.week_number
FROM
    all_weeks
LEFT JOIN data_mart.clean_weekly_sales ON data_mart.clean_weekly_sales.week_number = all_weeks.week_number
WHERE
    data_mart.clean_weekly_sales.week_number IS NULL;